
  #### Plan (dev) 📖`success`

  <details><summary>Show Plan</summary>

  ```tf
data.google_iam_workload_identity_pool.curiostack_apps_github-id-pool_152DA641: Reading...
data.google_iam_workload_identity_pool.curiostack_apps_github-id-pool_152DA641: Read complete after 0s [id=projects/catsearch10-dev/locations/global/workloadIdentityPools/github]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_artifact_registry_repository.curiostack_apps_docker-registry_A1B336F8 will be created
  + resource "google_artifact_registry_repository" "curiostack_apps_docker-registry_A1B336F8" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "catsearch10-dev"
      + repository_id    = "docker"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # google_artifact_registry_repository.curiostack_apps_ghcr-repo_152C3998 will be created
  + resource "google_artifact_registry_repository" "curiostack_apps_ghcr-repo_152C3998" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "REMOTE_REPOSITORY"
      + name             = (known after apply)
      + project          = "catsearch10-dev"
      + repository_id    = "ghcr"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + remote_repository_config {
          + docker_repository {
              + public_repository = "DOCKER_HUB"

              + custom_repository {
                  + uri = "https://ghcr.io"
                }
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # google_artifact_registry_repository_iam_member.curiostack_apps_docker-member-github_7B17A2D3 will be created
  + resource "google_artifact_registry_repository_iam_member" "curiostack_apps_docker-member-github_7B17A2D3" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "principal://iam.googleapis.com/projects/494080677300/locations/global/workloadIdentityPools/github/subject/repo:curioswitch/catsearch10:environment:dev"
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # google_artifact_registry_repository_iam_member.curiostack_apps_ghcr-repo-member-github_3DE789F4 will be created
  + resource "google_artifact_registry_repository_iam_member" "curiostack_apps_ghcr-repo-member-github_3DE789F4" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "principal://iam.googleapis.com/projects/494080677300/locations/global/workloadIdentityPools/github/subject/repo:curioswitch/catsearch10:environment:dev"
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # google_identity_platform_config.curiostack_identity_identity-platform_A7816979 will be created
  + resource "google_identity_platform_config" "curiostack_identity_identity-platform_A7816979" {
      + authorized_domains = [
          + "localhost",
          + "alpha.catsearch.curioswitch.org",
          + "catsearch10-dev.web.app",
          + "catsearch10-dev.firebaseapp.com",
        ]
      + id                 = (known after apply)
      + name               = (known after apply)
      + project            = "catsearch10-dev"

      + client (known after apply)

      + mfa (known after apply)

      + monitoring (known after apply)

      + sign_in {
          + hash_config = (known after apply)

          + email {
              + enabled = true
            }
        }

      + sms_region_config (known after apply)
    }

  # google_project_iam_custom_role.curiostack_apps_cloudrun-deployer_B2A24521 will be created
  + resource "google_project_iam_custom_role" "curiostack_apps_cloudrun-deployer_B2A24521" {
      + deleted     = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "run.operations.get",
          + "run.services.create",
          + "run.services.get",
          + "run.services.update",
        ]
      + project     = "catsearch10-dev"
      + role_id     = "cloudRunDeployer"
      + stage       = "GA"
      + title       = "Cloud Run Deployer"
    }

  # google_project_iam_custom_role.curiostack_identity_firebaseauth-config-secret-viewer_C970CB1E will be created
  + resource "google_project_iam_custom_role" "curiostack_identity_firebaseauth-config-secret-viewer_C970CB1E" {
      + deleted     = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "firebaseauth.configs.getSecret",
        ]
      + project     = "catsearch10-dev"
      + role_id     = "firebaseauthConfigsSecretViewer"
      + stage       = "GA"
      + title       = "Firebase Auth Config Secret Viewer"
    }

  # google_project_iam_member.curiostack_apps_github-cloudrun-deploy_C7EA46ED will be created
  + resource "google_project_iam_member" "curiostack_apps_github-cloudrun-deploy_C7EA46ED" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "principal://iam.googleapis.com/projects/494080677300/locations/global/workloadIdentityPools/github/subject/repo:curioswitch/catsearch10:environment:dev"
      + project = "catsearch10-dev"
      + role    = (known after apply)
    }

  # google_project_iam_member.curiostack_identity_terraform-viewer-firebase-secret_905F8698 will be created
  + resource "google_project_iam_member" "curiostack_identity_terraform-viewer-firebase-secret_905F8698" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-viewer@catsearch10-dev.iam.gserviceaccount.com"
      + project = "catsearch10-dev"
      + role    = (known after apply)
    }

  # google_project_service.curiostack_apps_service-artifactregistry_778E288B will be created
  + resource "google_project_service" "curiostack_apps_service-artifactregistry_778E288B" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "catsearch10-dev"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.curiostack_apps_service-cloudtrace_14911F12 will be created
  + resource "google_project_service" "curiostack_apps_service-cloudtrace_14911F12" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "catsearch10-dev"
      + service            = "cloudtrace.googleapis.com"
    }

  # google_project_service.curiostack_apps_service-monitoring_A23E4C62 will be created
  + resource "google_project_service" "curiostack_apps_service-monitoring_A23E4C62" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "catsearch10-dev"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.curiostack_apps_service-run_9934FD54 will be created
  + resource "google_project_service" "curiostack_apps_service-run_9934FD54" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "catsearch10-dev"
      + service            = "run.googleapis.com"
    }

  # google_project_service.curiostack_identity_identitytoolkit_956D917A will be created
  + resource "google_project_service" "curiostack_identity_identitytoolkit_956D917A" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "catsearch10-dev"
      + service            = "identitytoolkit.googleapis.com"
    }

  # google_storage_bucket.curiostack_apps_otel-bucket_C6F9BEBB will be created
  + resource "google_storage_bucket" "curiostack_apps_otel-bucket_C6F9BEBB" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "catsearch10-dev-otel"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_object.curiostack_apps_otel-default-config_E35AA087 will be created
  + resource "google_storage_bucket_object" "curiostack_apps_otel-default-config_E35AA087" {
      + bucket         = "catsearch10-dev-otel"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "otel-config-default.yaml"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```

  </details>
